# CASE STUDY:PANDAS MERGE FUNCTION

In [1]:
import pandas as pd
import numpy as np

In [2]:
da1 = {
  "name": ["ali", "zeo", "John"],
  "age": [50, 40, 30]
}

da2 = {
  "name": ["amir", "zeo", "Micky"],
  "age": [77, 44, 22]
}

In [3]:
da1

{'name': ['ali', 'zeo', 'John'], 'age': [50, 40, 30]}

In [4]:
da2

{'name': ['amir', 'zeo', 'Micky'], 'age': [77, 44, 22]}

In [5]:
df1 = pd.DataFrame(da1)
df2 = pd.DataFrame(da2)

In [6]:
df1.merge(df2, how='right')

    name  age
0   amir   77
1    zeo   44
2  Micky   22

In [7]:
df1.merge(df2,how='left')

   name  age
0   ali   50
1   zeo   40
2  John   30

In [8]:
df1.merge(df2,how='outer')

    name  age
0    ali   50
1    zeo   40
2   John   30
3   amir   77
4    zeo   44
5  Micky   22

In [9]:
df1.merge(df2,how='inner')

Empty DataFrame
Columns: [name, age]
Index: []

In [10]:
df1.merge(df2,how='cross')

  name_x  age_x name_y  age_y
0    ali     50   amir     77
1    ali     50    zeo     44
2    ali     50  Micky     22
3    zeo     40   amir     77
4    zeo     40    zeo     44
5    zeo     40  Micky     22
6   John     30   amir     77
7   John     30    zeo     44
8   John     30  Micky     22

In [11]:
pd.merge(df1, df2,on="age",how='left')

  name_x  age name_y
0    ali   50    NaN
1    zeo   40    NaN
2   John   30    NaN

In [12]:
pd.merge(df1, df2,on="age",how='right')

  name_x  age name_y
0    NaN   77   amir
1    NaN   44    zeo
2    NaN   22  Micky

In [13]:
pd.merge(df1, df2,left_index=True,right_index=True)

  name_x  age_x name_y  age_y
0    ali     50   amir     77
1    zeo     40    zeo     44
2   John     30  Micky     22

In [14]:
pd.merge(df1, df2,left_index=True,right_index=True,indicator='True')

  name_x  age_x name_y  age_y  True
0    ali     50   amir     77  both
1    zeo     40    zeo     44  both
2   John     30  Micky     22  both

In [15]:
pd.merge(df1,df2,left_on='name',right_on='name',how='left')

   name  age_x  age_y
0   ali     50    NaN
1   zeo     40   44.0
2  John     30    NaN

In [16]:
pd.merge(df1,df2,left_on='name',right_on='name',how='right')

    name  age_x  age_y
0   amir    NaN     77
1    zeo   40.0     44
2  Micky    NaN     22

In [17]:
pd.merge(df1,df2,left_on='name',right_on='name',how='inner')

  name  age_x  age_y
0  zeo     40     44

In [18]:
pd.merge(df1,df2,left_on='name',right_on='name',how='outer')

    name  age_x  age_y
0    ali   50.0    NaN
1    zeo   40.0   44.0
2   John   30.0    NaN
3   amir    NaN   77.0
4  Micky    NaN   22.0

In [19]:
df1.merge(df2,left_on='name',right_on='name')

  name  age_x  age_y
0  zeo     40     44

In [20]:
df1.merge(df2,left_on='age',right_on='age')

Empty DataFrame
Columns: [name_x, age, name_y]
Index: []

In [21]:
pd.merge(df1,df2,on='name',how='left',indicator=True)

   name  age_x  age_y     _merge
0   ali     50    NaN  left_only
1   zeo     40   44.0       both
2  John     30    NaN  left_only

In [22]:
pd.merge(df1,df2,on='name',how='right',indicator=True)

    name  age_x  age_y      _merge
0   amir    NaN     77  right_only
1    zeo   40.0     44        both
2  Micky    NaN     22  right_only

In [23]:
pd.merge(df1,df2,on='name',how='outer',indicator=True)

    name  age_x  age_y      _merge
0    ali   50.0    NaN   left_only
1    zeo   40.0   44.0        both
2   John   30.0    NaN   left_only
3   amir    NaN   77.0  right_only
4  Micky    NaN   22.0  right_only

In [24]:
pd.merge(df1,df2,on='name',how='inner',indicator=True)

  name  age_x  age_y _merge
0  zeo     40     44   both